mahdi-benhassen/AgriNetPro_gw_node/rcp_h2/sdkconfig.defaults
# Target: ESP32-H2 (802.15.4 RCP)
CONFIG_IDF_TARGET="esp32h2"

# Zigbee RCP
CONFIG_ZB_ENABLED=y
CONFIG_ZB_RCP=y

# UART for RCP (Connect to S3)
CONFIG_ZB_RCP_UART_TX_PIN=0
CONFIG_ZB_RCP_UART_RX_PIN=1
CONFIG_ZB_RCP_UART_PORT=0
CONFIG_ZB_RCP_UART_BAUDRATE=115200

# Optimization
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
